josekostyun/MSP430Final/main.c
#include <msp430.h>
#include <string.h>
#include <stdint.h>
#include "init.h"
#include "parser.h"

// Parsed GPS fields (remain here)
char latitude[12] = "0000000000";
char longitude[12] = "0000000000";
char fix_status = '0';

volatile uint8_t ble_ready = 0; //testing only

int main(void)
{
    WDTCTL = WDTPW | WDTHOLD;        // Stop watchdog timer
    PM5CTL0 &= ~LOCKLPM5;             // Unlock GPIO pins

    Initialize_Clock();
    Initialize_GPS_UART();
    Initialize_Bluetooth_UART();
    Configure_MTK3339();

    __enable_interrupt();

    //Testing Only
    while (!ble_ready);

    GPS_queryConfig(); //GPS Configue test
    Bluetooth_sendString("GPS Ready\r\n");


    while(1)
    {
        if(new_sentence)
        {
            new_sentence = 0;

            // Check if it's an RMC sentence
            if(strstr(gps_buffer, "RMC"))
            {
                parse_GPRMC(gps_buffer);

                // Send GPS data to Bluetooth
                Bluetooth_sendString("GPS: ");
                Bluetooth_sendString(gps_buffer);
                Bluetooth_sendString("\r\n");

                // Send parsed coordinates and fix status
                // RMC uses 'A' for active/valid, 'V' for void/invalid
                if(fix_status == 'A')
                {
                    Bluetooth_sendString("LAT: ");
                    Bluetooth_sendString(latitude);
                    Bluetooth_sendString(" LON: ");
                    Bluetooth_sendString(longitude);
                    Bluetooth_sendString(" FIX: ");
                    Bluetooth_sendChar(fix_status);
                    Bluetooth_sendString("\r\n");
                }
                else
                {
                    Bluetooth_sendString("NO FIX\r\n");
                }
            }

            gps_idx = 0;
        }
    }

    return 0;
}
